Autodesk.Revit.DB.ImageView.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ImageTypeOptions)
Create an ImageView containing an image imported from disk.
document:
The document in which to create the view.
options:
Options that specify what image to load.
Returns:
The newly created view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The image filename is an empty string.
-or-
The image file is not a supported image file type.
-or-
The image file is password protected.
-or-
The image file does not contain the requested page number.
-or-
The image file could not be read and may be corrupt.
-or-
An error occurred while handling the external resource corresponding to the image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The image file does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The image file is a PDF file, but PDF import is not available in the installed Revit.
Since:
2020